app/Models/CandidatesModel.php

SELECT *
FROM `users`
WHERE `ref_id` = '129'
SELECT `user_profiles`.`role`, `user_profiles`.`user_id`, `user_profiles`.`name`, `user_profiles`.`created_at`
FROM `user_profiles`
WHERE `user_id` = '226'
---
    public function getrefData($refId)
    {
        // Step 1: Find all users with the given ref_id.
        $builder = $this->db->table('users');
        $builder->select('*');
        $builder->where('ref_id', $refId);
        $query = $builder->get();
        $users = $query->getResult();

        // If no users found, return null
        if (empty($users)) {
            return null;
        }

        // print_r($users);
        // die();



        $result = [];

        // Step 2: Loop through each user to find data in other tables
        foreach ($users as $user) {
            $userId = $user->id;
            // $userData = ['user' => $user];

            // Step 3: Search in 'user_profiles' table
            $profileBuilder = $this->db->table('user_profiles');
            $profileBuilder->select('user_profiles.role, user_profiles.user_id, user_profiles.name, user_profiles.created_at');
            $profileBuilder->where('user_id', $userId);
            $profileQuery = $profileBuilder->get();

SELECT `hoteliers`.`user_id`, `hoteliers`.`role`, `hoteliers`.`name`, `hoteliers`.`created_at`
FROM `hoteliers`
WHERE `user_id` = '226'
---
                $hotelierBuilder = $this->db->table('hoteliers');
                $hotelierBuilder->select('hoteliers.user_id, hoteliers.role, hoteliers.name, hoteliers.created_at');
                $hotelierBuilder->where('user_id', $userId);
                $hotelierQuery = $hotelierBuilder->get();

SELECT `user_profiles`.`role`, `user_profiles`.`user_id`, `user_profiles`.`name`, `user_profiles`.`created_at`
FROM `user_profiles`
WHERE `user_id` = '0'
---
    public function getrefbyidData($user_id)
    {

        $userId = $user_id;
        // $userData = ['user' => $user];

        // Step 3: Search in 'user_profiles' table
        $profileBuilder = $this->db->table('user_profiles');
        $profileBuilder->select('user_profiles.role, user_profiles.user_id, user_profiles.name, user_profiles.created_at');
        $profileBuilder->where('user_id', $userId);
        $profileQuery = $profileBuilder->get();

SELECT `users`.*, `user_profiles`.*
FROM `users`
JOIN `user_profiles` ON `user_profiles`.`user_id` = `users`.`id`
WHERE `user_profiles`.`role` = 'Job Seeker'
---
    public function getAllUserData()
    {
        $builder = $this->db->table('users');
        $builder->select('users.*, user_profiles.*');
        $builder->join('user_profiles', 'user_profiles.user_id = users.id');
        $builder->where('user_profiles.role', "Job Seeker");
        $query = $builder->get();