app/Models/RoleModel.php

    public function getallJobData()
    {
        $builder = $this->db->table('role_listings');
        $builder->select('role_listings.*, hoteliers.name,hoteliers.address,hoteliers.city,hoteliers.state,hoteliers.pin_code,hoteliers.address');
        $builder->join('hoteliers', 'hoteliers.user_id = role_listings.hotelier_id');

        $query = $builder->get();
---
SELECT `role_listings`.*, `hoteliers`.`name`, `hoteliers`.`address`, `hoteliers`.`city`, `hoteliers`.`state`, `hoteliers`.`pin_code`, `hoteliers`.`address`
FROM `role_listings`
JOIN `hoteliers` ON `hoteliers`.`user_id` = `role_listings`.`hotelier_id`
SELECT `role`.*
FROM `role`